test_mix/oneParticlesSediment_silicon_oil_cfdemSolverIB/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.3;

deltaT          0.0001;

writeControl    adjustableRunTime; // timeStep;

writeInterval   0.004; // 10; // 0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable off; //yes;

adjustTimeStep  no;

maxCo           1;

maxDeltaT       1;


// ************************************************************************* //

/*
functions
{
    probes
    {
        type        probes;
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );
        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            (0.5001 0.5001 0.0001)
            (0.5001 0.5001 1.0001)
            (0.5001 0.5001 2.0001)
            (0.5001 0.5001 3.0001)
        );

        // Fields to be probed
        fields ( p );

        // Write at same frequency as fields
        outputControl   timeStep;//outputTime;
        outputInterval  1;
    }
}
*/

// ************************************************************************* //
